In [1]:
import pandas as pd
import numpy as np
from env import user,host,pw

In [2]:
def get_db_url(db):
    return f'mysql+pymysql://{user}:{pw}@{host}/{db}'

In [3]:
url = get_db_url("employees")
url

'mysql+pymysql://hopper_1567:bKMq6mHwzDUQOsRM5OMRI1FDsCSfSdju@157.230.209.171/employees'

In [4]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [5]:
'''url = get_db_url(user, host, pw, 'employes')
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)'''

"url = get_db_url(user, host, pw, 'employes')\npd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)"

In [6]:
'''url = get_db_url(user, host, pw, db)
pd.read_sql('SELECT * FROM employes LIMIT 5 OFFSET 50', url)'''

"url = get_db_url(user, host, pw, db)\npd.read_sql('SELECT * FROM employes LIMIT 5 OFFSET 50', url)"

In [7]:
employees = pd.read_sql('SELECT * FROM employees', url)
titles = pd.read_sql('SELECT * FROM titles', url)

In [8]:
employees.shape

(443308, 4)

In [14]:
titles.shape

(443308, 4)

In [9]:
employees.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [13]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [10]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [11]:
titles.to_date.sort_values(ascending=False)

0         9999-01-01
251516    9999-01-01
251529    9999-01-01
251528    9999-01-01
251526    9999-01-01
             ...
277603    1985-04-17
35527     1985-03-23
346216    1985-03-20
406358    1985-03-11
16064     1985-03-01
Name: to_date, Length: 443308, dtype: object

In [12]:
titles.to_date.sort_values(ascending=False).head(1)

0    9999-01-01
Name: to_date, dtype: object